app/Controllers/siswa/Dashboard.php

    public function index()
    {
        $siswaId = session()->get('siswa_id');

        // ✅ Tidak perlu cek sekolah_id
        $jadwalModel = new JadwalUjianModel();
        $jadwalUjian = $jadwalModel->getSemuaJadwalAktif(); // ✅ Ambil semua jadwal tanpa filter sekolah

        $bukuModel = new KoleksiBukuModel();
        $bukuTerbaru = $bukuModel
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT *
FROM `koleksi_buku`
ORDER BY `created_at` DESC
 LIMIT 5