app/Controllers/siswa/Home.php

    public function index()
    {
        $id_sekolah = session()->get('id_sekolah'); // dari session siswa
        $tanggal_hari_ini = date('Y-m-d');

        // Ujian Hari Ini
        $ujian_hari_ini = $this->jadwalUjianModel->getWithRelasi()
            ->where('jadwal_ujian.tanggal_mulai', $tanggal_hari_ini)
            ->where('jadwal_ujian.id_sekolah', $id_sekolah)
            ->where('jadwal_ujian.status', 'aktif')
            ->orderBy('jadwal_ujian.tanggal_mulai', 'ASC')
            ->findAll();

        // Ujian Sebelumnya
        $ujian_sebelumnya = $this->jadwalUjianModel->getWithRelasi()
            ->where('jadwal_ujian.tanggal_mulai <', $tanggal_hari_ini)
            ->where('jadwal_ujian.id_sekolah', $id_sekolah)
            ->whereIn('jadwal_ujian.status', ['aktif', 'selesai'])
            ->orderBy('jadwal_ujian.tanggal_mulai', 'DESC')
            ->findAll();
---
SELECT `jadwal_ujian`.*, `mata_pelajaran`.`nama_mapel`, `bank_soal`.`bank_code`, `jenis_ujian`.`jenis_ujian`, `sekolah`.`nama_sekolah`
FROM `jadwal_ujian`
LEFT JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal_ujian`.`id_mapel`
LEFT JOIN `bank_soal` ON `bank_soal`.`id_bank` = `jadwal_ujian`.`id_bank`
LEFT JOIN `jenis_ujian` ON `jenis_ujian`.`id_jenis_ujian` = `jadwal_ujian`.`id_jenis_ujian`
LEFT JOIN `sekolah` ON `sekolah`.`id` = `jadwal_ujian`.`id_sekolah`
WHERE `jadwal_ujian`.`tanggal_mulai` = '2025-07-31'
AND `jadwal_ujian`.`id_sekolah` IS NULL
AND `jadwal_ujian`.`status` = 'aktif'
ORDER BY `jadwal_ujian`.`tanggal_mulai` ASC
SELECT `jadwal_ujian`.*, `mata_pelajaran`.`nama_mapel`, `bank_soal`.`bank_code`, `jenis_ujian`.`jenis_ujian`, `sekolah`.`nama_sekolah`
FROM `jadwal_ujian`
LEFT JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal_ujian`.`id_mapel`
LEFT JOIN `bank_soal` ON `bank_soal`.`id_bank` = `jadwal_ujian`.`id_bank`
LEFT JOIN `jenis_ujian` ON `jenis_ujian`.`id_jenis_ujian` = `jadwal_ujian`.`id_jenis_ujian`
LEFT JOIN `sekolah` ON `sekolah`.`id` = `jadwal_ujian`.`id_sekolah`
WHERE `jadwal_ujian`.`tanggal_mulai` < '2025-07-31'
AND `jadwal_ujian`.`id_sekolah` IS NULL
AND `jadwal_ujian`.`status` IN ('aktif','selesai')
ORDER BY `jadwal_ujian`.`tanggal_mulai` DESC