app/Controllers/siswa/PelaksanaanUjian.php

    public function index($id_jadwal)
    {
        $id_siswa = session('siswa_id');

        // Ambil nomor peserta siswa
        $peserta = $this->pesertaModel->where('id_siswa', $id_siswa)->first();
        if (!$peserta) {
            return redirect()->to('siswa/dashboard')->with('error', 'Anda belum memiliki nomor peserta.');
        }

        // Cek jadwal
        $jadwal = $this->jadwalModel->find($id_jadwal);
        if (!$jadwal) {
            return redirect()->to('siswa/dashboard')->with('error', 'Jadwal ujian tidak ditemukan.');
        }

        // Ambil semua soal dari bank
        $soalList = $this->soalModel
            ->where('id_bank', $jadwal['id_bank'])
            ->orderBy('id_soal', 'ASC')
            ->findAll();
---
SELECT *
FROM `soal`
WHERE `id_bank` = '3'
ORDER BY `id_soal` ASC