app/Controllers/siswa/Perpustakaan.php

    public function index()
    {
        $jenisFilter = $this->request->getGet('jenis');
        $judulFilter = $this->request->getGet('judul');

        $data['judul']         = $judulFilter;
        $data['jenis']         = $jenisFilter;
        $data['jenis_buku']    = $this->jenisModel->findAll();
---
SELECT *
FROM `jenis_buku`