app/Models/JadwalUjianModel.php

    public function getSemuaJadwalAktif()
    {
        return $this->select('jadwal_ujian.*,
                              mata_pelajaran.nama_mapel,
                              bank_soal.bank_code,
                              jenis_ujian.jenis_ujian')
                    ->join('mata_pelajaran', 'mata_pelajaran.id = jadwal_ujian.id_mapel', 'left')
                    ->join('bank_soal', 'bank_soal.id_bank = jadwal_ujian.id_bank', 'left')
                    ->join('jenis_ujian', 'jenis_ujian.id_jenis_ujian = jadwal_ujian.id_jenis_ujian', 'left')
                    ->where('jadwal_ujian.status', 1)
                    ->orderBy('tanggal_mulai', 'DESC')
                    ->findAll();
---
SELECT `jadwal_ujian`.*, `mata_pelajaran`.`nama_mapel`, `bank_soal`.`bank_code`, `jenis_ujian`.`jenis_ujian`
FROM `jadwal_ujian`
LEFT JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal_ujian`.`id_mapel`
LEFT JOIN `bank_soal` ON `bank_soal`.`id_bank` = `jadwal_ujian`.`id_bank`
LEFT JOIN `jenis_ujian` ON `jenis_ujian`.`id_jenis_ujian` = `jadwal_ujian`.`id_jenis_ujian`
WHERE `jadwal_ujian`.`status` = 1
ORDER BY `tanggal_mulai` DESC