app/Models/KoleksiBukuModel.php

SELECT `koleksi_buku`.*, `jenis_buku`.`nama_jenis_buku`
FROM `koleksi_buku`
LEFT JOIN `jenis_buku` ON `jenis_buku`.`id` = `koleksi_buku`.`id_jenis_buku`
WHERE `koleksi_buku`.`status` = 'tampil'
ORDER BY `koleksi_buku`.`judul` ASC
---
    public function getFiltered($jenis = null, $judul = null)
    {
        $builder = $this->select('koleksi_buku.*, jenis_buku.nama_jenis_buku')
                        ->join('jenis_buku', 'jenis_buku.id = koleksi_buku.id_jenis_buku', 'left')
                        ->where('koleksi_buku.status', 'tampil');

        if (!empty($jenis)) {
            $builder->where('koleksi_buku.id_jenis_buku', $jenis);
        }

        if (!empty($judul)) {
            $builder->like('koleksi_buku.judul', $judul, 'after'); // judul dimulai dari huruf
        }

        return $builder->orderBy('koleksi_buku.judul', 'ASC')->findAll();